print("Hello World!")
print("Результат вычисления 2+3=",2+3)
print("Результат вычитания 2-10=",2-10)
print("Результат множества 25*350=",25*350)
print("Результат целочисленного деления 189//23=",189//23)
print("Результат деления 189/23=",189/23)
print("Результат сложения строк>>",'Я иду на работу'+' в 09:00')
print("Результат 2 операций: ", "1. 125 + 784 =", 125+784, " 2. 789 // 45 =", 789//45)

x = 2112
i = 0
ans = 0
while i < x:
    ans += sum(map(lambda x: x ** 2, [i // 10, i % 13]))
    i += 7
print(ans)

print(123424242143132324326922342152 + 213732174232497412039472189472409)
print("123424242143132324326922342152 + 213732174232497412039472189472409 =",123424242143132324326922342152 + 213732174232497412039472189472409)