
#Чтение строк и чисел с консоли
a = int(input())
b = int(input())
print (a + b)

name = input('What is you name?')
print('I love', name)


#Вася делает ремонт в комнате размером A на B метров и хочет положить на пол плитку. Сколько квадратных метров плитки ему нужно купить?
#Целые числа A и B задаются по одному в строке
print('Вася делает ремонт в комнате размером A на B метров и хочет положить на пол плитку. Сколько квадратных метров плитки ему нужно купить?')
print('Целые числа A и B задаются по одному в строке')

A = int(input())
B = int(input())
print(A * B)


#Вася делает ремонт в комнате размером A на B метров и хочет положить новые плинтуса. Сколько погонных метров плинтуса необходимо купить Васе?
#Целые числа A и B задаются по одному в строке
print('Вася делает ремонт в комнате размером A на B метров и хочет положить новые плинтуса. Сколько погонных метров плинтуса необходимо купить Васе?')
print('Целые числа A и B задаются по одному в строке')
A = int(input())
B = int(input())
print((A+B) * 2 )


#Вася делает ремонт на кухне размером X на Y метров и хочет положить настенную плитку. Сколько квадратных метров плитки нужно купить Васе, если высота стен на кухне равна Z?
#Числа X, Y и Z задаются по одному в строке.
print('Вася делает ремонт на кухне размером X на Y метров и хочет положить настенную плитку. Сколько квадратных метров плитки нужно купить Васе, если высота стен на кухне равна Z?')
print('Числа X, Y и Z задаются по одному в строке.')
A = int(input())
B = int(input())
Z = int(input())
print( ((A + B) * 2 ) * Z )


