# Лекция 2
print('Тест 1', 'Тест 2', 'Тест 3' , sep=',###,')
print ('1 + 2 + 3 + 4 = ', end='')
print (1 + 2 + 3 + 4)

# Задача 1
print('Питон', 'позволяет', 'автоматизировать', 'рутинные', 'задачи', 'на', 'решение', 'которых', 'вручную', 'уходят', 'лучшие', 'годы', 'жизни', sep=", ммм, ")

# Задача 2
print(12321482349287421983798237241 * 123721947294287497234957 )
print(2793042981421894210947210947 // 209734721987420234281947)